app/Controllers/Notes.php

SELECT `notes`.*, `categories`.`name` as `category_name`
FROM `notes`
JOIN `categories` ON `categories`.`id` = `notes`.`category_id`
WHERE `notes`.`user_id` = '3'
---
    public function index()
    {
        $data['notes'] = $this->noteModel->select('notes.*, categories.name as category_name')
                                        ->join('categories', 'categories.id = notes.category_id')
                                        ->where('notes.user_id', session()->get('id'))
                                        ->findAll();

INSERT INTO `notes` (`user_id`, `category_id`, `title`, `content`, `is_private`, `created_at`, `updated_at`) VALUES ('3', '3', 'asdavdvsdfvsdfv', 'sdfbdgsbgfbfbfb', 0, '2024-12-21 17:11:25', '2024-12-21 17:11:25')
---
                ];

                try {
                    $this->noteModel->insert($data);

SELECT *
FROM `categories`
---
            }
        }

        $data['categories'] = $this->categoryModel->findAll();

SELECT *
FROM `notes`
WHERE `notes`.`id` = '4'
UPDATE `notes` SET `category_id` = '3', `title` = 'asdavdvsdfvsdfv', `content` = 'sdfbdgsbgfbfbfb', `is_private` = 1, `updated_at` = '2024-12-21 17:11:31'
WHERE `notes`.`id` IN ('4')
---
    public function edit($id)
    {
        $note = $this->noteModel->find($id);

        if (!$note || $note['user_id'] !== session()->get('id')) {
            $this->session->setFlashdata('message', 'Not bulunamadı veya düzenleme yetkiniz yok');
            $this->session->setFlashdata('type', 'danger');
            return redirect()->to(base_url('notes'));
        }

        if ($this->request->getMethod() === 'post') {
            $rules = [
                'title' => 'required|min_length[3]',
                'category_id' => 'required|numeric',
                'content' => 'required|min_length[10]'
            ];

            if ($this->validate($rules)) {
                $data = [
                    'category_id' => $this->request->getPost('category_id'),
                    'title' => $this->request->getPost('title'),
                    'content' => $this->request->getPost('content'),
                    'is_private' => $this->request->getPost('is_private') ? 1 : 0
                ];

                try {
                    $this->noteModel->update($id, $data);

SELECT *
FROM `categories`
---
        }

        $data['note'] = $note;
        $data['categories'] = $this->categoryModel->findAll();